x = new Vue({
    el: "#app",
    data: {
        OLEG_KEYS: ['Мясо', 'По вегану', 'Пивчара', 'Винишко', 'Коктейли', 'Музыка', 'Недорого', 'Возле работы', 'Возле дома', 'В центре'],
        EKB_BARS: {
            'Пан-сметан': [2, 1, 2, 1, 1, 0, 0, 0, 2, 0],
            'Янки-бар': [1, 1, 2, 0, 0, 1, 1, 0, 0, 1],
            'Jawsspot': [0, 0, 2, 0, 0, 1, 1, 0, 0, 1],
            'New bar': [1, 0, 1, 0, 1, 2, 1, 0, 0, 1],
            'Ratskeller': [2, 1, 2, 1, 1, 0, 0, 0, 0, 2],
            'Маруся': [0, 0, 1, 0, 0, 0, 2, 0, 0, 1],
            'Peperonni': [1, 1, 1, 1, 0, 0, 1, 0, 0, 1],
            'Мизантроп': [0, 0, 1, 0, 1, 2, 1, 0, 0, 1],
            '8500': [1, 1, 1, 1, 2, 0, 1, 2, 0, 0]
        }
    }
})

function govno(expectations, ratings) {
    return 0;
}

for (var bar in x.$data['EKB_BARS']) {
    console.log(bar, x.$data['EKB_BARS'][bar]);
}
